# pandas
## pandas is a powerful python library used for data manipulation and analysis. it also provides data structure like Series(1D) and Dataframes(2D) along with statistical function to opereate onn data

In [2]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\acer\appdata\roaming\python\python313\site-packages (2.3.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\acer\appdata\roaming\python\python313\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\acer\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\acer\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\acer\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\acer\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [7]:
import pandas as pd
import numpy as np

# series 
## it a one dimenttional array which can hold any data type
### Syntax:
###     pd.Series(data,index)

In [4]:
# creating series

ser = pd.Series([1, 5, 6, 7, 8], index=['a', 'b', 'c', 'd', 'e'])
print(ser)

a    1
b    5
c    6
d    7
e    8
dtype: int64

In [5]:
a = (3, 5, 7, 9, 8) #tuple
b = ['a', 'b', 'c', 'd', 'e'] #list

ser = pd.Series(a, index=b)
print(ser)

a    3
b    5
c    7
d    9
e    8
dtype: int64

# Dataframe
## it is two dimensional array which contains rows and columns
### syntax:
### pd.DataFrame(data)

In [6]:
# create DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [12]:
Data = {
    'ID' : [1, 2, 3, 4, 5, 6],
    'Name' : ['Ved', 'Eve', 'Demon', 'Alena', 'Stephen', 'John'],
    'Age' : [25, 23, 26, np.nan, 29, 32],
    'Gender' : ['M', 'F', 'M', 'F', 'M', 'M'],
    'Salary' : [50000, 60000, 70000, 80000, np.nan, 90000]
}
df = pd.DataFrame(Data)
print(df)

   ID     Name   Age Gender   Salary
0   1      Ved  25.0      M  50000.0
1   2      Eve  23.0      F  60000.0
2   3    Demon  26.0      M  70000.0
3   4    Alena   NaN      F  80000.0
4   5  Stephen  29.0      M      NaN
5   6     John  32.0      M  90000.0

In [13]:
# Reading File
''' 
1. pd.read_csv('file_name.csv') - to read csv file
2. pd.read_excel('file_name.xlsx') - to read excel file
3. pd.read_json('file_name.json') - to read json file
4. pd.read_html('file_name.html') - to read html file
5. pd.read_sql('query', connection) - to read sql database
6. pd.read_pickle('file_name.pkl') - to read pickle file
'''

" \n1. pd.read_csv('file_name.csv') - to read csv file\n2. pd.read_excel('file_name.xlsx') - to read excel file\n3. pd.read_json('file_name.json') - to read json file\n4. pd.read_html('file_name.html') - to read html file\n5. pd.read_sql('query', connection) - to read sql database\n6. pd.read_pickle('file_name.pkl') - to read pickle file\n"

In [15]:
# Example of reading a CSV file

df2 = pd.read_csv('Example.csv') # Make sure to replace 'Example.csv' with the actual path to your CSV file
print(df2)

FileNotFoundError: [Errno 2] No such file or directory: 'Example.csv'

In [ ]:
# Data inspections functions / methods
''' 
1. df.head() - to view the first 5 rows of the DataFrame
2. df.head(n) - to view the first n rows of the DataFrame
3. df.tail() - to view the last 5 rows of the DataFrame
4. df.tail(n) - to view the last n rows of the DataFrame
5. df.info() - to view the summary of the DataFrame
6. df.describe() - to view the summary statistics of the DataFrame
7. df.shape - to view the shape of the DataFrame (number of rows and columns)
8. df.columns - to view the columns of the DataFrame
9. df.index - to view the index of the DataFrame
10. df.dtypes - to view the data types of the columns in the DataFrame
11. df.isnull() - to check for null values in the DataFrame
12. df.notnull() - to check for non-null values in the DataFrame
13. df.duplicated() - to check for duplicate rows in the DataFrame
14. df.nunique() - to view the number of unique values in each column
'''

In [16]:
df.head(3)  # View the first 3 rows of the DataFrame

   ID   Name   Age Gender   Salary
0   1    Ved  25.0      M  50000.0
1   2    Eve  23.0      F  60000.0
2   3  Demon  26.0      M  70000.0

In [17]:
df.tail(3)  # View the last 3 rows of the DataFrame

   ID     Name   Age Gender   Salary
3   4    Alena   NaN      F  80000.0
4   5  Stephen  29.0      M      NaN
5   6     John  32.0      M  90000.0

In [18]:
df.info()  # View the summary of the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      6 non-null      int64
 1   Name    6 non-null      object
 2   Age     5 non-null      float64
 3   Gender  6 non-null      object
 4   Salary  5 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 372.0+ bytes

In [ ]:
df.describe()  # View the summary statistics of the DataFrame of only numeric columns
# 25% means 25% of the data is below this value

             ID        Age        Salary
count  6.000000   5.000000      5.000000
mean   3.500000  27.000000  70000.000000
std    1.870829   3.535534  15811.388301
min    1.000000  23.000000  50000.000000
25%    2.250000  25.000000  60000.000000
50%    3.500000  26.000000  70000.000000
75%    4.750000  29.000000  80000.000000
max    6.000000  32.000000  90000.000000

In [20]:
df.columns

Index(['ID', 'Name', 'Age', 'Gender', 'Salary'], dtype='object')

In [21]:
df.shape

(6, 5)

In [22]:
# Handling missing and null values
''' 
1. df.isnull() - to check for null values in the DataFrame. returns True for null values and False for non-null values
2. df.notnull() - to check for non-null values in the DataFrame. returns True for non-null values and False for null values
3. df.dropna() - to drop rows with null values
4. df.fillna(value) - to fill null values with a specified value
5. df.isnull().sum() - to count the number of null values in each column
6. df.notnull().sum() - to count the number of non-null values in each column
'''

' \n1. df.isnull() - to check for null values in the DataFrame. returns True for null values and False for non-null values\n2. df.notnull() - to check for non-null values in the DataFrame. returns True for non-null values and False for null values\n3. df.dropna() - to drop rows with null values\n4. df.fillna(value) - to fill null values with a specified value\n5. df.isnull().sum() - to count the number of null values in each column\n6. df.notnull().sum() - to count the number of non-null values in each column\n'

In [23]:
df.isnull()  # Check for null values in the DataFrame

      ID   Name    Age  Gender  Salary
0  False  False  False   False   False
1  False  False  False   False   False
2  False  False  False   False   False
3  False  False   True   False   False
4  False  False  False   False    True
5  False  False  False   False   False

In [28]:
df.isnull().sum()  # Count the number of null values in each column

ID        0
Name      0
Age       1
Gender    0
Salary    1
dtype: int64

In [29]:
df.dropna()  # Drop rows with null values

   ID   Name   Age Gender   Salary
0   1    Ved  25.0      M  50000.0
1   2    Eve  23.0      F  60000.0
2   3  Demon  26.0      M  70000.0
5   6   John  32.0      M  90000.0

In [30]:
df.fillna(0)  # Fill null values with 0

   ID     Name   Age Gender   Salary
0   1      Ved  25.0      M  50000.0
1   2      Eve  23.0      F  60000.0
2   3    Demon  26.0      M  70000.0
3   4    Alena   0.0      F  80000.0
4   5  Stephen  29.0      M      0.0
5   6     John  32.0      M  90000.0

In [ ]:
# Aggregation and Grouping
''' 
1. df.mean() - to calculate the mean of each column. can perform column-wise or on full DataFrame
2. df.sum() - to calculate the sum of each column.
3. df.agg() - used for multiple aggregation functions
4. df.value_counts() - returns the occurrence of each unique value in a column
4. df.groupby() - group the columns
'''

' \n1. df.mean() - to calculate the mean of each column\n'

In [33]:
df.sum()  # Calculate the sum of each column

ID                                 21
Name      VedEveDemonAlenaStephenJohn
Age                             135.0
Gender                         MFMFMM
Salary                       350000.0
dtype: object

In [34]:
df['Salary'].sum()  # Calculate the sum of the 'Salary' column

np.float64(350000.0)

In [ ]:
df.mean(numeric_only=True)  # Calculate the mean of each column
# numeric_only=True ensures that only numeric columns are considered for the mean calculation

ID            3.5
Age          27.0
Salary    70000.0
dtype: float64

In [37]:
df.agg({'Age': ['mean', 'max']})  # Multiple aggregation functions on specific columns

       Age
mean  27.0
max   32.0

In [38]:
df['Gender'].value_counts()  # Count occurrences of each unique value

Gender
M    4
F    2
Name: count, dtype: int64

In [ ]:
# Merging and Joining DataFrames
''' 
1. pd.concat([df1, df2])  # Concatenate two DataFrames vertically
2. pd.merge(df1, df2, on='common_column')  # Merge two DataFrames on a common column
   # on specifies the column to merge on, can also use left_on and right_on for different column names
   # how='inner' (default), 'outer', 'left', 'right' to specify the type of join
3. df1.join(df2, on='common_column')  # Join two DataFrames on a common column
'''

In [39]:
pd.concat([df, df])  # Concatenate two DataFrames vertically

   ID     Name   Age Gender   Salary
0   1      Ved  25.0      M  50000.0
1   2      Eve  23.0      F  60000.0
2   3    Demon  26.0      M  70000.0
3   4    Alena   NaN      F  80000.0
4   5  Stephen  29.0      M      NaN
5   6     John  32.0      M  90000.0
0   1      Ved  25.0      M  50000.0
1   2      Eve  23.0      F  60000.0
2   3    Demon  26.0      M  70000.0
3   4    Alena   NaN      F  80000.0
4   5  Stephen  29.0      M      NaN
5   6     John  32.0      M  90000.0

In [40]:
pd.merge(df, df, on='ID')  # Merge two DataFrames on a common column 'ID'

   ID   Name_x  Age_x Gender_x  Salary_x   Name_y  Age_y Gender_y  Salary_y
0   1      Ved   25.0        M   50000.0      Ved   25.0        M   50000.0
1   2      Eve   23.0        F   60000.0      Eve   23.0        F   60000.0
2   3    Demon   26.0        M   70000.0    Demon   26.0        M   70000.0
3   4    Alena    NaN        F   80000.0    Alena    NaN        F   80000.0
4   5  Stephen   29.0        M       NaN  Stephen   29.0        M       NaN
5   6     John   32.0        M   90000.0     John   32.0        M   90000.0